---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HostIdParam
source: html/bd39215e-0dcb-b439-0cda-3e95118f2142.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HostIdParam Property

"Host Id"

## Syntax (C#)
```csharp
public static ForgeTypeId HostIdParam { get; }
```